import 'package:flutter/material.dart';
import 'package:home_care/widgets/my_scaffold.dart';

class TermsAndConditionsScreen extends StatelessWidget {
  const TermsAndConditionsScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return MyScaffold(
      title: Text(
        "الشروط و الاحكام",
        style: TextStyle(
          color: Colors.white,
          fontWeight: FontWeight.bold,
          fontSize: 20,
        ),
      ),
      body: Column(
        children: [
          Text("""
- يرجى قراءة هذه الشروط والأحكام قبل البدء فى استخدام البرنامج فعند استخدامك لاى من خدمات البرنامج فانت توافق على البنود والشروط والاحكام
- تطبق الشروط والأحكام
- فإن الشروط والأحكام تعد قانونًا منظما للعلاقات بين الأطراف المتعاقدة، وخرق هذه الشروط أو عدم الالتزام بها بالشكل المنصوص يعد خرقًا لمبدأ الاتفاق من الأساس ويلغيه. في بعض العقود يعاقب الطرف الغير ملزم بجانبه من الاتفاق بدفع مقابل مادي، أو منح الطرف الآخر بعض الامتيازات. فالشروط والأحكام تلزم الطرفيين على الوفاء بجانبهم من الاتفاق، وتعاقب الخارق له على الفور. لكن ليس هنا تنحصر أهميتها، فهي لها العديد من المميزات الأخرى التي سنذكرها كالآتي:

تنظيم العمل: تساعدك الشروط والأحكام على تنظيم جانبك من الحقوق والواجبات، وجانب المستخدم أيضًا لمنصتك. فعن طريقها يمكنك أن تحدد بشكل قاطع حدود ما يسمح للمستخدم الاستفادة منه، وحدود انتفاعك أنت أيضًا بالمعلومات التي يشاركها معك.
منع الانتهاكات: تساعد الشروط والأحكام على وضع حل رادع للانتهاكات الإلكترونية، سواء كانت:
نشر محتوى غير قانوني يستهدف الترويج لممارسات غير مشروعة ينطوي عليها مسؤولية مدنية
نشر الأخبار والأكاذيب التي تتعلق بتشوية الصورة العامة لأحد الأشخاص
نشر محتوى يستهدف ابتزاز أحد الأفراد أو يضم مواد إباحية فاضحة
انتحال المستخدم لهوية أحد الأفراد
استخدام الموقع لتحميل برامج ضارة أو نشر فيروسات أو أي شيفرات حاسوبية مؤذية
استخدام الموقع في الترويج لمنافس أو نشر محتوى لا علاقة له بالخدمات المقدمة
تمثيل أحد المؤسسات أو الهيئات بدون أن يكون المستخدم مخولًا بادعاء هذا التمثيل
نشر مواد تضر بالملكية الفكرية لأصحابها وتدخل في إطار سرقتها
السيطرة على الموقع والتغير من تصميمه أو التعديل فيه
التعدي على حقوق المستخدمين الأخريين وسرقة حساباتهم الشخصية
كل هذه انتهاكات يتم نشرها بوضوح في القسم الخاص بالشروط والأحكام، ويتم إضافة لها بعض المحاذير الأخرى بناءً على طبيعة الخدمة المقدمة.- اجراءات الامن والامان لكلا الطرفين سواء مقدم الرعاية الصحية والعميل يتحملها الطرفين على سواء ولا تتحمل الشركة المسؤلية عنهما وستتابع الشركة العمليات وتدقق على المعاملات بين الطرفين
- نحن نقوم بجمع البيانات الخاصة بالعملاء والموظفين وذالك لامان الطرفين. كما ان الموقع غير مسؤول بكافه التعاملات التي تتم من خلاله في التقصير الناتج من الطرفين وان كافه التعاملات القائمه بين الطرفين تكون مجرد توصيل الاطراف ببعض ليس الا وغير مسؤول قانونا بشتي الطرق
. وان الموقع تقديم خدمه طبيه مجانيه دون ادني مسؤليه عليه

حقوق الملكية: تساعدك الشروط والأحكام الموضوعة في منصتك الإلكترونية على توثيق حقك الفكري والقانوني في كل ما يتعلق بهذه المنصة، فلا يجوز للمستخدم سرقتها أو سوء استغلالها، أو يعمد إلى نسبها إليه.
تحديد المسؤولية: عندما تضع الشروط والأحكام المنظمة بينك وبين عملائك المستهدفين، فأنت بذلك تضع حدود للمسؤولية بينك وبينهم. فأنت غير ملزم إذا قام العملاء بمشاركة معلوماتهم الشخصية مع أحد المستخدمين الأخريين، وأنت غير ملزم أيضًا إذا قام أحدهم بإرجاع منتجات لا توافق بنود الاسترجاع والاستبدال. على جانب الآخر أنت ملزم بتسوية المنازعات التي يتقدم لها العميل، وأنت ملزم بعملية توصيل المنتجات في أوقاتها، وأنت ملزم أيضًا أن تقدم للعميل منتجًا يوافق التفاصيل التي تم نشرها، وأنت ملزم كذلك على رد المبلغ لصاحبه إذا ما وجد خطأ في المنتج المقدم، وأنت ملزم كذلك على توفير حماية لبيانات العملاء من التعرض للاختراق.
الحفاظ على الخصوصية: المعلومات التي يشاركها المستخدمون معك سواء كانت المعلومات الخاصة بالمعاملات الشرائية، أو بياناتهم الشخصية في تسجيل الدخول، تعد بيانات خاصة جدًا يجب أن يتم تقنين استخدامها وحدود هذا الاستخدام. الكثير من العملاء يرغبون في الشعور بالأمان من أن بياناتهم يتم استعمالها بطريقة مشروعة ولا يتم تسربيها لأي جهة أخرى غير معلنة، لذلك يجب أن توضح بالتفصيل حدود استخدامك لهذه البيانات، والبنود التي تلتزم بها للحفاظ على خصوصيتهم، وكلما كانت هذه البنود مصاغة بطريقة واضحة ومركزة وسهلة الفهم، كلما كان أفضل للعميل ولصورة علامتك التجارية.
- ان المنصة لا تغير ولا تستطيع تغير الرأى العام والهدف منها هيا إيصال مقدم الرعاية الصحية ب طالب الرعاية والخدمة الصحية والهدف منها مساعدة المجتمع
- لا يمكن استرداد التكاليف فى حالة عمل الاجراء او تغيير رائ الحالة
- من مسؤلية مقدم الرعاية الصحية ان يكون مؤهلا علميا ومهنيا وان يقدم الخدمة الصحية على اعلى مستوى دون تقصير منه
- من مسؤلية مستقبل الخدمة ان لا يتعدى على مقدم الخدمة الصحية بالسب او التطاول عليه والا يتم اثبات الواقعة فى المحضر ويتم مقاضاته
- ومع مراعاة الشروط والأحكام فان الشركة تخلى مسؤليتها عن اى من الطرفين مع مراعاة تقديم خدمة عالية الجودة
- ويجوز للشركة التعديل على الشروط المتعلقة بالخدمات من حين لاخريلتزم كلا الطرفين بالمعاملات داخل حدود ومظلة البرنامج ومعرفة كافة التفاصيل والتعاملات بين الطرفين والتزام مقدم الرعاية الصحية بقواعد العمل والحسابات وارسال النسبة المتفق عليها بين البرنامج ومقدم الخدمة طبقا لقانون العمل
"""),
        ],
      ),
    );
  }
}
